products/wso2_MB/topics/MBTopicClient/messages/sample_custom_msg.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples">
 <soapenv:Header/>
 <soapenv:Body>
    <ser:getSimpleQuote>
       <ser:symbol>TTTTTTTTTTTTTTTTTTTTTTTTTTTT</ser:symbol>
    </ser:getSimpleQuote>
 </soapenv:Body>
</soapenv:Envelope>
