chapter_04/getFullQuote.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
    <soapenv:Body>
        <ser:getFullQuote>
            <ser:request>
                <xsd:symbol>WSO2</xsd:symbol>
            </ser:request>
        </ser:getFullQuote>
    </soapenv:Body>
</soapenv:Envelope>